udemy_folder/sumwsclient/result.xml


<soap:Envelope
	xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<xenc:EncryptedKey
				xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
				Id="EK-f4514a90-1e3c-44e9-94b4-19bf45277530">
				<xenc:EncryptionMethod
					Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
				<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
					<wsse:SecurityTokenReference>
						<ds:X509Data>
							<ds:X509IssuerSerial>
								<ds:X509IssuerName>CN=John</ds:X509IssuerName>
								<ds:X509SerialNumber>819710760</ds:X509SerialNumber>
							</ds:X509IssuerSerial>
						</ds:X509Data>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
				<xenc:CipherData>
					<xenc:CipherValue>Eu39r7X9k0dvoiTeQyPcot5gJWVUy46DmYS1rTHIN+bUtF7LH5HnmDx7BzcgoZBY+bbi1s4XqG9fI6X9mIJTSwsEkxpcyKsO05Y3O61XzcFtRH1tfQs9a4TMMjepoYzpXtW7b3ZYKKWbYsLIbdQnj+tPombjC6yFHclUsxhoV5pyI1i/8gj/4mmanz6iwWNr027EEVqJzIxXh/O3ZwAEUHLKozAH1olpmWPmeWIMKCYMn4RBDrhfBRe8Lj/hGLsZQl4XhkKYa2HcPQh1TlsiCdbubqp+bvfJng8LRDp9GypqpV2JB7520aUCcdVTgrOMvMj75dHAFdYw5Rpz/tY3+A==
					</xenc:CipherValue>
				</xenc:CipherData>
				<xenc:ReferenceList>
					<xenc:DataReference
						URI="#ED-2820775f-0d19-44f1-8409-13e341c9ef7b" />
				</xenc:ReferenceList>
			</xenc:EncryptedKey>
			<wsse:UsernameToken
				wsu:Id="UsernameToken-6e4e1fde-c4c3-4595-a554-8b4014d2c50b">
				<wsse:Username>sumuser</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">sumpass</wsse:Password>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<xenc:EncryptedData
			xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
			Id="ED-2820775f-0d19-44f1-8409-13e341c9ef7b"
			Type="http://www.w3.org/2001/04/xmlenc#Content">
			<xenc:EncryptionMethod
				Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" />
			<ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
				<wsse:SecurityTokenReference
					xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
					xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
					wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
					<wsse:Reference
						URI="#EK-f4514a90-1e3c-44e9-94b4-19bf45277530" />
				</wsse:SecurityTokenReference>
			</ds:KeyInfo>
			<xenc:CipherData>
				<xenc:CipherValue>rkbjhvSc2+eBT0N+Ji3DdiSqBZ0e5Ynu5ag+SDJMhNA3VKbvTnV6JW5Vt1kQvCmUqjxcUFhSXnnzj+HQu2En7BstJsxnjV08+XrgYnUHctlb/e8uTDM2sobmQB3iSK820vhLM9JbQ+4H1hVeEftwRAe7HsB54pstKi6jlzbNyuCqqK2qTMSPo2jwg3irhVxu
				</xenc:CipherValue>
			</xenc:CipherData>
		</xenc:EncryptedData>
	</soap:Body>
</soap:Envelope>
